Сервер_ошибок/src/InformationRegisters/со_СообщенияОбОшибках/со_СообщенияОбОшибках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>со_СообщенияОбОшибках</name>
  <resources>
    <name>ДанныеОшибки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОшибки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сервер_ошибок/src/CommonModules/со_ОбщегоНазначенияСерверВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработать полученные сообщения.
Процедура ОбработатьПолученныеСообщения() Экспорт
	
 Данные = ПолучитьНеобработанныеСообщенияОбОшибках();
 Если Данные.Количество() > 0  Тогда
		СоздатьДокументыРегистрацияОшибки(Данные);
 КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


// Получить необработанные сообщения об ошибках из РС со_СообщенияОбОшибках
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить необработтные сообщения об ошибках
Функция ПолучитьНеобработанныеСообщенияОбОшибках() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	со_СообщенияОбОшибках.ДатаОшибки,
		|	со_СообщенияОбОшибках.ДанныеОшибки
		|ИЗ
		|	РегистрСведений.со_СообщенияОбОшибках КАК со_СообщенияОбОшибках";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


// Создать документы регистрация ошибки.
// 
// Параметры:
//  Данные - ТаблицаЗначений - Данные
Процедура СоздатьДокументыРегистрацияОшибки(Данные) 

	Для каждого ТекущаяСтрока из Данные Цикл
		СоздатьДокументРегистрацияОшибки(ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры


// Заполнение реквизитов документа на основе данных из регистра сведений
Процедура СоздатьДокументРегистрацияОшибки(ДанныеДляЗаполнения) Экспорт

	Временныйфайл  = ПолучитьИмяВременногоФайла(".zip");
	ВременнаяПапка = КаталогВременныхФайлов() + "ОбработкаСообщенийОбОшиках\";
		
	
	// Получение значения из хранилища значений
	Хранилище = ДанныеДляЗаполнения.ДанныеОшибки.Получить();
	Если Хранилище <> Неопределено Тогда
	// Предполагаем, что в хранилище лежит объект, который можно записать в файл,
	// например, ДвоичныеДанные или строка, содержащая путь к файлу или его содержимое.

		Попытка
			Хранилище.Записать(Временныйфайл);
			Сообщить("Данные успешно записаны в файл: " + Временныйфайл);
			ZipФайл = Новый ЧтениеZipФайла(Временныйфайл);
			ZipФайл.ИзвлечьВсе(ВременнаяПапка, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ZipФайл.Закрыть();
			Сообщить("Файл успешно извлечен из архива: " + Временныйфайл);
			
			// Удаление временного файла
			УдалитьФайлы(Временныйфайл);
			УдалитьФайлы(ВременнаяПапка);
		Исключение
			Сообщить("Ошибка записи данных в файл: " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Хранилище значений пусто или не содержит данных.");
	КонецЕсли;

	
//	НовыйДокумент = Документы.РегистрацияОшибки.СоздатьДокумент();
//	НовыйДокумент.ДатаОшибки = ДанныеДляЗаполнения.ДатаОшибки;
//	НовыйДокумент.Сообщение = ДанныеДляЗаполнения.Сообщение;
//		
//	НовыйДокумент.Записать();

	
КонецПроцедуры

#КонецОбласти
